/************************************************************
 default parameter
 -> 아래 코드가 정상적으로 동작할 수 있도록 기본값을
	이용하여 구현하시오.
	출력 결과는 주석과 같이
*************************************************************/

#include <iostream>
using namespace std;

void foo(int a, int b = 1, int c = 2, int d = 3)
{
	cout << a << " : " << b << " : " << c << " : " << d << endl;
}


int main()
{
	foo(10, 20, 30, 40);	// 10 : 20 : 30 : 40 
	foo(10, 20, 30);		// 10 : 20 : 30 : 3
	foo(10, 20);				// 10 : 20 : 2  : 3
	foo(10);				// 10 : 1 : 2 : 3

	return 0;
}
